DanPhelanIDSY/tirtos_cc13xx_cc26xx_2_21_01_08/products/tidrivers_cc13xx_cc26xx_2_21_01_01/packages/ti/drivers/power/PowerCC26XX.c
/*
 * Copyright (c) 2015-2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQueueNTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*
 *  ======== PowerCC26XX.c ========
 */

#include <xdc/std.h>
#include <stdbool.h>
#include <xdc/runtime/Assert.h>
#include <ti/sysbios/family/arm/m3/Hwi.h>
#include <ti/sysbios/knl/Clock.h>
#include <ti/sysbios/knl/Task.h>
#include <ti/sysbios/knl/Swi.h>

#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

/* driverlib header files */
#include <inc/hw_types.h>
#include <inc/hw_prcm.h>
#include <inc/hw_nvic.h>
#include <inc/hw_aon_wuc.h>
#include <inc/hw_aon_rtc.h>
#include <inc/hw_memmap.h>
#include <inc/hw_ccfg.h>
#include <inc/hw_rfc_pwr.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/pwr_ctrl.h>
#include <driverlib/prcm.h>
#include <driverlib/aon_wuc.h>
#include <driverlib/aon_ioc.h>
#include <driverlib/aon_rtc.h>
#include <driverlib/aon_event.h>
#include <driverlib/aux_wuc.h>
#include <driverlib/osc.h>
#include <driverlib/cpu.h>
#include <driverlib/vims.h>
#include <driverlib/rfc.h>
#include <driverlib/sys_ctrl.h>
#include <driverlib/driverlib_release.h>
#include <driverlib/setup.h>
#include <driverlib/ccfgread.h>


static unsigned int configureXOSCHF(unsigned int action);
static unsigned int nopResourceHandler(unsigned int action);
static unsigned int configureRFCoreClocks(unsigned int action);
static void switchXOSCHFclockFunc(uintptr_t arg0);
static void disableLFClockQualifiers(uintptr_t arg);
static void emptyClockFunc(uintptr_t arg);
static unsigned int notify(uint32_t eventType);

/* RCOSC calibration functions functions */
extern void PowerCC26XX_doCalibrate(void);
extern bool PowerCC26XX_initiateCalibration(void);
extern void PowerCC26XX_auxISR(uintptr_t arg);
extern void PowerCC26XX_RCOSC_clockFunc(uintptr_t arg);

/* Externs */
extern const PowerCC26XX_Config PowerCC26XX_config;

/* Module_State */
PowerCC26XX_ModuleState PowerCC26XX_module = {
    .notifyList = { NULL },         /* list of registered notifications    */
    .constraintMask = 0,            /* the constraint mask                 */
    .clockObj = { NULL },           /* Clock object for scheduling wakeups */
    .xoscClockObj = { NULL },       /* Clock object for XOSC_HF switching  */
    .lfClockObj = { NULL },         /* Clock object for LF clock check     */
    .calClockStruct = { NULL },     /* Clock object for RCOSC calibration  */
    .hwiStruct = { NULL },          /* hwi object for calibration          */
    .nDeltaFreqCurr = 0,            /* RCOSC calibration variable          */
    .nCtrimCurr = 0,                /* RCOSC calibration variable          */
    .nCtrimFractCurr = 0,           /* RCOSC calibration variable          */
    .nCtrimNew = 0,                 /* RCOSC calibration variable          */
    .nCtrimFractNew = 0,            /* RCOSC calibration variable          */
    .nRtrimNew = 0,                 /* RCOSC calibration variable          */
    .nRtrimCurr = 0,                /* RCOSC calibration variable          */
    .nDeltaFreqNew = 0,             /* RCOSC calibration variable          */
    .bRefine = false,               /* RCOSC calibration variable          */
    .state = Power_ACTIVE,          /* current transition state            */
    .xoscPending = FALSE,           /* is XOSC_HF activation in progress?  */
    .calLF = FALSE,                 /* calibrate RCOSC_LF?                 */
    .hwiState = 0,                  /* calibration AUX ISR state           */
    .busyCal = FALSE,               /* already busy calibrating            */
    .calStep = 1,                   /* current calibration step            */
    .firstLF = TRUE,                /* is this first LF calibration?       */
    .enablePolicy = FALSE,          /* default value is FALSE              */
    .initialized = FALSE,           /* whether Power_init has been called  */
    .constraintCounts = { 0, 0, 0, 0, 0 },
    .resourceCounts = { 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    .resourceHandlers = {
      configureRFCoreClocks,
      configureXOSCHF,
      nopResourceHandler
    },                              /* special resource handler functions */
    .policyFxn = NULL               /* power policyFxn */
};

/* resource database */
const PowerCC26XX_ResourceRecord resourceDB[PowerCC26XX_NUMRESOURCES] = {
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_TIMER0 },/* PERIPH_GPT0 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_TIMER1 },/* PERIPH_GPT1 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_TIMER2 },/* PERIPH_GPT2 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_TIMER3 },/* PERIPH_GPT3 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_SERIAL, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_SSI0 },  /* PERIPH_SSI0 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_SSI1 },  /* PERIPH_SSI1 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_SERIAL, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_UART0 }, /* PERIPH_UART0 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_SERIAL, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_I2C0 },  /* PERIPH_I2C0 */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_TRNG },  /* PERIPH_TRNG */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_GPIO },  /* PERIPH_GPIO */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_DOMAIN_SYSBUS,
    PRCM_PERIPH_UDMA }, /* PERIPH_UDMA */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_CRYPTO },/* PERIPH_CRYPTO */
    { PowerCC26XX_PERIPH  | PowerCC26XX_DOMAIN_PERIPH, PowerCC26XX_NOPARENT,
    PRCM_PERIPH_I2S },   /* PERIPH_I2S */
    { PowerCC26XX_SPECIAL | PowerCC26XX_DOMAIN_RFCORE, PowerCC26XX_NOPARENT,
    0 },    /* PERIPH_RFCORE */
    { PowerCC26XX_SPECIAL | PowerCC26XX_NOPARENT, PowerCC26XX_NOPARENT,
    1 },    /* XOSC_HF */
    { PowerCC26XX_DOMAIN  | PowerCC26XX_NOPARENT, PowerCC26XX_NOPARENT,
    PRCM_DOMAIN_PERIPH },/* DOMAIN_PERIPH */
    { PowerCC26XX_DOMAIN  | PowerCC26XX_NOPARENT, PowerCC26XX_NOPARENT,
    PRCM_DOMAIN_SERIAL },/* DOMAIN_SERIAL */
    { PowerCC26XX_DOMAIN  | PowerCC26XX_NOPARENT, PowerCC26XX_NOPARENT,
    PRCM_DOMAIN_RFCORE },/* DOMAIN_RFCORE */
    { PowerCC26XX_SPECIAL | PowerCC26XX_NOPARENT, PowerCC26XX_NOPARENT,
    2 }     /* DOMAIN_SYSBUS */
};


/* ****************** Power APIs ******************** */

