DanPhelanIDSY/tirtos_cc13xx_cc26xx_2_21_01_08/products/tidrivers_cc13xx_cc26xx_2_21_01_01/packages/ti/drivers/power/PowerCC26XX.c
/*
 *  ======== Power_releaseConstraint ========
 *  Release a previously declared constraint.
 */
void Power_releaseConstraint(unsigned int constraintId)
{
    unsigned int key;
    uint8_t count;

    /* assert constraintId is valid */
    Assert_isTrue(constraintId < PowerCC26XX_NUMCONSTRAINTS, NULL);

    key = Hwi_disable();

    /* get the count of the constraint */
    count = PowerCC26XX_module.constraintCounts[constraintId];

    /* Assert constraint count is not 0 */
    Assert_isTrue(count != 0, NULL);

    count--;

    /* save the updated count */
    PowerCC26XX_module.constraintCounts[constraintId] = count;

    if (count == 0) {
        PowerCC26XX_module.constraintMask &= ~(1 << constraintId);
    }

    Hwi_restore(key);
}

/*
 *  ======== Power_releaseDependency ========
 *  Release a previously declared dependency.
 */
void Power_releaseDependency(unsigned int resourceId)
{
    uint8_t parent;
    uint8_t count;
    uint32_t id;
    unsigned int key;

    /* assert resourceId is valid */
    Assert_isTrue(resourceId < PowerCC26XX_NUMRESOURCES, NULL);

    /* disable interrupts */
    key = Hwi_disable();

    /* read and decrement the reference count */
    count = PowerCC26XX_module.resourceCounts[resourceId];

    /* Assert dependency count is not 0 */
    Assert_isTrue(count != 0, NULL);

    count--;

    /* save the reference count */
    PowerCC26XX_module.resourceCounts[resourceId] = count;

    /* if this was the last dependency being released.., */
    if (count == 0) {
        /* deactivate this resource ... */
        id = resourceDB[resourceId].driverlibID;

        /* is resource a peripheral?... */
        if (resourceDB[resourceId].flags & PowerCC26XX_PERIPH) {
            PRCMPeripheralRunDisable(id);
            PRCMPeripheralSleepDisable(id);
            PRCMPeripheralDeepSleepDisable(id);
            PRCMLoadSet();
            while (!PRCMLoadGet()) {
                ;
            }
        }
        /* else, does resource require a special handler?... */
        else if (resourceDB[resourceId].flags & PowerCC26XX_SPECIAL) {
            /* call the special handler */
            PowerCC26XX_module.resourceHandlers[id](PowerCC26XX_DISABLE);
        }

        /* else resource is a power domain */
        else {
            PRCMPowerDomainOff(id);
            while (PRCMPowerDomainStatus(id) != PRCM_DOMAIN_POWER_OFF) {
                ;
            }
        }

        /* propagate release up the dependency tree ... */

        /* check for a first parent */
        parent = resourceDB[resourceId].flags & PowerCC26XX_PARENTMASK;

        /* if 1st parent, make recursive call to release that dependency */
        if (parent != PowerCC26XX_NOPARENT) {
            Power_releaseDependency(parent);
        }

        /* check for a second parent */
        parent = resourceDB[resourceId].flags2 & PowerCC26XX_PARENTMASK;

        /* if 2nd parent, make recursive call to release that dependency */
        if (parent != PowerCC26XX_NOPARENT) {
            Power_releaseDependency(parent);
        }
    }

    /* re-enable interrupts */
    Hwi_restore(key);
}

/*
 *  ======== Power_setConstraint ========
 *  Declare an operational constraint.
 */
void Power_setConstraint(unsigned int constraintId)
{
    unsigned int key;

    /* assert constraint id is valid */
    Assert_isTrue(constraintId < PowerCC26XX_NUMCONSTRAINTS, NULL);

    /* disable interrupts */
    key = Hwi_disable();

    /* set the specified constraint in the constraintMask */
    PowerCC26XX_module.constraintMask |= 1 << constraintId;

    /* increment the specified constraint count */
    PowerCC26XX_module.constraintCounts[constraintId]++;

   /* re-enable interrupts */
    Hwi_restore(key);
}

/*
 *  ======== Power_setDependency ========
 *  Declare a dependency upon a resource.
 */
void Power_setDependency(unsigned int resourceId)
{
    uint8_t parent;
    uint8_t count;
    uint32_t id;
    unsigned int key;

    /* assert resourceId is valid */
    Assert_isTrue(resourceId < PowerCC26XX_NUMRESOURCES, NULL);

    /* disable interrupts */
    key = Hwi_disable();

    /* read and increment reference count */
    count = PowerCC26XX_module.resourceCounts[resourceId]++;

    /* if resource was NOT activated previously ... */
    if (count == 0) {
        /* propagate set up the dependency tree ... */

        /* check for a first parent */
        parent = resourceDB[resourceId].flags & PowerCC26XX_PARENTMASK;

        /* if first parent, make recursive call to set that dependency */
        if (parent != PowerCC26XX_NOPARENT) {
            Power_setDependency(parent);
        }

        /* check for a second parent */
        parent = resourceDB[resourceId].flags2 & PowerCC26XX_PARENTMASK;

        /* if second parent, make recursive call to set that dependency */
        if (parent != PowerCC26XX_NOPARENT) {
            Power_setDependency(parent);
        }

        /* now activate this resource ... */
        id = resourceDB[resourceId].driverlibID;

        /* is resource a peripheral?... */
        if (resourceDB[resourceId].flags & PowerCC26XX_PERIPH) {
            PRCMPeripheralRunEnable(id);
            PRCMPeripheralSleepEnable(id);
            PRCMPeripheralDeepSleepEnable(id);
            PRCMLoadSet();
            while (!PRCMLoadGet()) {
                ;
            }
        }
        /* else, does resource require a special handler?... */
        else if (resourceDB[resourceId].flags & PowerCC26XX_SPECIAL) {
            /* call the special handler */
            PowerCC26XX_module.resourceHandlers[id](PowerCC26XX_ENABLE);
        }
        /* else resource is a power domain */
        else {
            PRCMPowerDomainOn(id);
            while (PRCMPowerDomainStatus(id) != PRCM_DOMAIN_POWER_ON) {
                ;
            }
        }
    }

    /* re-enable interrupts */
    Hwi_restore(key);
}

/*
 *  ======== Power_setPolicy ========
 *  Set the Power policy function
 */
void Power_setPolicy(Power_PolicyFxn policy)
{
    PowerCC26XX_module.policyFxn = policy;
}

