DanPhelanIDSY/tirtos_cc13xx_cc26xx_2_21_01_08/products/tidrivers_cc13xx_cc26xx_2_21_01_01/packages/ti/drivers/power/PowerCC26XX.c
/*
 *  ======== Power_shutdown ========
 */
unsigned int Power_shutdown(unsigned int shutdownState,
                            uint32_t shutdownTime)
{
    unsigned int status = Power_EFAIL;
    unsigned int constraints;
    unsigned int hwiKey;

    /* next make sure Power is not still busy with a previous transition */
    hwiKey = Hwi_disable();

    /* make sure shutdown request doesn't violate a constraint */
    constraints = Power_getConstraintMask();

    if (constraints & (1 << PowerCC26XX_SD_DISALLOW)) {
        status = Power_ECHANGE_NOT_ALLOWED;
    }
    else if (PowerCC26XX_module.state == Power_ACTIVE) {
        /* set new transition state to entering shutdown */
        PowerCC26XX_module.state = Power_ENTERING_SHUTDOWN;

        /* signal all clients registered for pre-shutdown notification */
        status = notify(PowerCC26XX_ENTERING_SHUTDOWN);

        /* check for any error */
        if (status != Power_NOTIFYDONE) {
            PowerCC26XX_module.state = Power_ACTIVE;
            Hwi_restore(hwiKey);
            return (status);
        }

        /* now proceed with shutdown sequence ... */

        /* 1. Switch HF, MF, and LF clocks to source from RCOSC_HF */
        if (OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_RCOSC_HF) {
            OSCClockSourceSet(OSC_SRC_CLK_HF | OSC_SRC_CLK_MF,
                OSC_RCOSC_HF);
            while (!OSCHfSourceReady());
            OSCHfSourceSwitch();
        }

        /* 2. Make sure DMA and CRYTO clocks are off in deep-sleep */
        PRCMPeripheralDeepSleepDisable(PRCM_PERIPH_CRYPTO);
        PRCMPeripheralDeepSleepDisable(PRCM_PERIPH_UDMA);
        PRCMLoadSet();
        while (!PRCMLoadGet()) {
            ;
        }

        /* 3. Power OFF AUX and disconnect from bus */
        AUXWUCPowerCtrl(AUX_WUC_POWER_OFF);

        /* 4. Remove AUX force ON */
        HWREG(AON_WUC_BASE + AON_WUC_O_AUXCTL) &=
            ~AON_WUC_AUXCTL_AUX_FORCE_ON;

        /*
         * 5. Reset AON event source IDs to avoid pending events powering
         * on MCU/AUX
         */
        HWREG(AON_EVENT_BASE + AON_EVENT_O_MCUWUSEL) = 0x3F3F3F3F;
        HWREG(AON_EVENT_BASE + AON_EVENT_O_AUXWUSEL) = 0x003F3F3F;

        /* sync AON */
        SysCtrlAonSync();

        /*
         * 6. Enable shutdown - this latches the IOs, so configuration of
         * IOCFGx registers must be done prior to this
         */
        AONWUCShutDownEnable();

        /* 7. Sync AON */
        SysCtrlAonSync();

        /* 8. Wait until AUX powered off */
        while (AONWUCPowerStatusGet() & AONWUC_AUX_POWER_ON);

        /* 9. Request to power off MCU when go to deep sleep */
        PRCMMcuPowerOff();

        /*
         * 10. Turn off power domains inside MCU VD (BUS, FL_BUS, RFC,
         * CPU)
         */
        PRCMPowerDomainOff(PRCM_DOMAIN_RFCORE | PRCM_DOMAIN_SERIAL |
            PRCM_DOMAIN_PERIPH | PRCM_DOMAIN_CPU | PRCM_DOMAIN_VIMS);

        /* 11. Deep sleep to activate shutdown */
        PRCMDeepSleep();
    }
    else {
        status = Power_EBUSY;
    }
    /* NOTE: if shutdown succeeded, should never get here */

    /* return failure status */
    PowerCC26XX_module.state = Power_ACTIVE;

    /* re-enable interrupts */
    Hwi_restore(hwiKey);

    /* if get here, failed to shutdown, return error code */
    return (status);
}

/*
 *  ======== Power_sleep ========
 */
unsigned int Power_sleep(unsigned int sleepState)
{
    unsigned int status = Power_SOK;
    unsigned int xosc_hf_active = FALSE;
    uint32_t postEventLate;
    uint32_t poweredDomains = 0;
    uint32_t preEvent;
    uint32_t postEvent;
    unsigned int constraints;
    bool retainCache = FALSE;
    uint32_t modeVIMS;
    unsigned int taskKey;
    unsigned int swiKey;

    /* first validate the sleep code */
    if (sleepState != PowerCC26XX_STANDBY) {
        status = Power_EFAIL;
    }

    if (status == Power_SOK) {

        if (PowerCC26XX_module.state == Power_ACTIVE) {

            /* set transition state to entering sleep */
            PowerCC26XX_module.state = Power_ENTERING_SLEEP;
        }
        else {
            status = Power_EBUSY;
        }

        if (status == Power_SOK) {

            /* setup sleep vars */
            preEvent = PowerCC26XX_ENTERING_STANDBY;
            postEvent = PowerCC26XX_AWAKE_STANDBY;
            postEventLate = PowerCC26XX_AWAKE_STANDBY_LATE;

            /* disable Task scheduling; allow Swis and Hwis for notifications */
            taskKey = Task_disable();

            /* signal all clients registered for pre-sleep notification */
            status = notify(preEvent);

            /* check for any error */
            if (status != Power_NOTIFYDONE) {
                PowerCC26XX_module.state = Power_ACTIVE;
                Task_restore(taskKey);          /* re-enable scheduler */
                return (status);
            }

            /* now disable Swi scheduling */
            swiKey = Swi_disable();

            /* 1. Freeze the IOs on the boundary between MCU and AON */
            AONIOCFreezeEnable();

            /* 2. If XOSC_HF is active, force it off */
            if(OSCClockSourceGet(OSC_SRC_CLK_HF) == OSC_XOSC_HF) {
                xosc_hf_active = TRUE;
                configureXOSCHF(PowerCC26XX_DISABLE);
            }

            /* 3. Allow AUX to power down */
            AONWUCAuxWakeupEvent(AONWUC_AUX_ALLOW_SLEEP);

            /* 4. Make sure writes take effect */
            SysCtrlAonSync();

            /* now proceed to transition to Power_STANDBY ... */

            /* 5. Query and save domain states before powering them off */
            if (Power_getDependencyCount(PowerCC26XX_DOMAIN_RFCORE)) {
                poweredDomains |= PRCM_DOMAIN_RFCORE;
            }
            if (Power_getDependencyCount(PowerCC26XX_DOMAIN_SERIAL)){
                poweredDomains |= PRCM_DOMAIN_SERIAL;
            }
            if (Power_getDependencyCount(PowerCC26XX_DOMAIN_PERIPH)) {
                poweredDomains |= PRCM_DOMAIN_PERIPH;
            }

