DanPhelanIDSY/tirtos_cc13xx_cc26xx_2_21_01_08/products/tidrivers_cc13xx_cc26xx_2_21_01_01/packages/ti/drivers/power/PowerCC26XX.c
            /* 6. Gate running deep sleep clocks for Crypto and DMA */
            if (Power_getDependencyCount(PowerCC26XX_PERIPH_CRYPTO)) {
                PRCMPeripheralDeepSleepDisable(
                    resourceDB[PowerCC26XX_PERIPH_CRYPTO].driverlibID);
            }
            if (Power_getDependencyCount(PowerCC26XX_PERIPH_UDMA)) {
                PRCMPeripheralDeepSleepDisable(
                    resourceDB[PowerCC26XX_PERIPH_UDMA].driverlibID);
            }
            /* 7. Make sure clock settings take effect */
            PRCMLoadSet();

            /* 8. Request power off of domains in the MCU voltage domain */
            PRCMPowerDomainOff(poweredDomains | PRCM_DOMAIN_CPU);

            /* 9. Request uLDO during standby */
            PRCMMcuUldoConfigure(true);

            /* query constraints to determine if cache should be retained */
            constraints = Power_getConstraintMask();
            if (constraints & (1 << PowerCC26XX_SB_VIMS_CACHE_RETAIN)) {
                retainCache = TRUE;
            }

            /* 10. If don't want VIMS retention in standby, disable it now... */
            if (retainCache == FALSE) {

                /* 10.1 Get the current VIMS mode */
                do {
                    modeVIMS = VIMSModeGet(VIMS_BASE);
                } while (modeVIMS == VIMS_MODE_CHANGING);

                /* 10.2 If in a cache mode, turn VIMS off */
                if (modeVIMS == VIMS_MODE_ENABLED) {

                    /* 10.3 Now turn off the VIMS */
                    VIMSModeSet(VIMS_BASE, VIMS_MODE_OFF);
                }

                /* 10.4 Now disable retention */
                PRCMCacheRetentionDisable();
            }

            /* 11. Setup recharge parameters */
            SysCtrlSetRechargeBeforePowerDown(XOSC_IN_HIGH_POWER_MODE);

            /* 12. Make sure all writes have taken effect */
            SysCtrlAonSync();

            /* 13. Invoke deep sleep to go to STANDBY */
            PRCMDeepSleep();

            /* 14. If didn't retain VIMS in standby, re-enable retention now */
            if (retainCache == FALSE) {

                /* 14.1 If previously in a cache mode, restore the mode now */
                if (modeVIMS == VIMS_MODE_ENABLED) {
                    VIMSModeSet(VIMS_BASE, modeVIMS);
                }

                /* 14.2 Re-enable retention */
                PRCMCacheRetentionEnable();
            }

            /* 15. Start forcing on power to AUX */
            AONWUCAuxWakeupEvent(AONWUC_AUX_WAKEUP);

            /* 16. Start re-powering power domains */
            PRCMPowerDomainOn(poweredDomains);

            /* 17. Restore deep sleep clocks of Crypto and DMA */
            if (Power_getDependencyCount(PowerCC26XX_PERIPH_CRYPTO)) {
                PRCMPeripheralDeepSleepEnable(
                    resourceDB[PowerCC26XX_PERIPH_CRYPTO].driverlibID);
            }
            if (Power_getDependencyCount(PowerCC26XX_PERIPH_UDMA)) {
                PRCMPeripheralDeepSleepEnable(
                    resourceDB[PowerCC26XX_PERIPH_UDMA].driverlibID);
            }

            /* 18. Make sure clock settings take effect */
            PRCMLoadSet();

            /* 19. Release request for uLDO */
            PRCMMcuUldoConfigure(false);

            /* 20. Set transition state to EXITING_SLEEP */
            PowerCC26XX_module.state = Power_EXITING_SLEEP;

            /* 21. Wait until all power domains are back on */
            while (PRCMPowerDomainStatus(poweredDomains) !=
                   PRCM_DOMAIN_POWER_ON) {
                ;
            }

            /*
             * 22. Signal clients registered for early post-sleep notification;
             * this should be used to initialize any timing critical or IO
             * dependent hardware
             */
            status = notify(postEvent);

            /* 23. Disable IO freeze and ensure RTC shadow value is updated */
            AONIOCFreezeDisable();
            SysCtrlAonSync();

            /* 24. Wait for AUX to power up */
            while(!(AONWUCPowerStatusGet() & AONWUC_AUX_POWER_ON)) {};

            /* 25. If XOSC_HF was forced off above, initiate switch back */
            if (xosc_hf_active == TRUE) {
                configureXOSCHF(PowerCC26XX_ENABLE);
            }

            /* 26. Re-enable interrupts */
            CPUcpsie();

            /*
             * 27. Signal all clients registered for late post-sleep
             * notification
             */
            status = notify(postEventLate);

            /*
             * 28. Now clear the transition state before re-enabling
             * scheduler
             */
            PowerCC26XX_module.state = Power_ACTIVE;

            /* 29. Re-enable Swi scheduling */
            Swi_restore(swiKey);

            /* 30. Adjust recharge parameters */
            SysCtrlAdjustRechargeAfterPowerDown();

            /* re-enable Task scheduling */
            Task_restore(taskKey);
        }
    }

    return (status);
}

/*
 *  ======== Power_unregisterNotify ========
 *  Unregister for a power notification.
 *
 */
void Power_unregisterNotify(Power_NotifyObj * pNotifyObj)
{
    unsigned int key;

    /* remove notify object from its event queue */
    key = Hwi_disable();

    /* remove notify object from its event queue */
    List_remove(&PowerCC26XX_module.notifyList, (List_Elem *)pNotifyObj);

    Hwi_restore(key);
}

/* ****************** CC26XX specific APIs ******************** */

/*
 *  ======== PowerCC26XX_calibrate ========
 *  Plug this function into the PowerCC26XX_Config structure
 *  if calibration is needed.
 */
bool PowerCC26XX_calibrate(unsigned int arg)
{
    bool retVal = FALSE;
    Clock_Params clockParams;

    switch (arg) {
        case PowerCC26XX_SETUP_CALIBRATE:
            /*
             *  If RCOSC calibration is enabled, construct a Clock object for
             *  delays. Set timeout to '1' Clock tick period for the minimal
             *  delay. The object will explicitly started by Power module when
             *  appropriate
             */
            Clock_Params_init(&clockParams);
            clockParams.period = 0;
            clockParams.startFlag = FALSE;
            clockParams.arg = 0;
            Clock_construct(&PowerCC26XX_module.calClockStruct,
                &PowerCC26XX_RCOSC_clockFunc, 1, &clockParams);

