DanPhelanIDSY/tirtos_cc13xx_cc26xx_2_21_01_08/products/tidrivers_cc13xx_cc26xx_2_21_01_01/packages/ti/drivers/power/PowerCC26XX.c
            /* construct the Hwi */
            Hwi_construct(&PowerCC26XX_module.hwiStruct,
                44, PowerCC26XX_auxISR, NULL, NULL);

            break;

        case PowerCC26XX_INITIATE_CALIBRATE:
            retVal = PowerCC26XX_initiateCalibration();
            break;

        case PowerCC26XX_DO_CALIBRATE:
            PowerCC26XX_doCalibrate();
            break;
    }

    return (retVal);
}

/*
 *  ======== PowerCC26XX_doWFI ========
 */
void PowerCC26XX_doWFI(void)
{
    __asm(" wfi");
}

/*
 *  ======== PowerCC26XX_getClockHandle ========
 */
Clock_Handle PowerCC26XX_getClockHandle()
{
    return ((Clock_Handle)&PowerCC26XX_module.clockObj);
}

/*
 *  ======== PowerCC26XX_noCalibrate ========
 *  Plug this function into the PowerCC26XX config structure if calibration
 *  is not needed.
 */
bool PowerCC26XX_noCalibrate(unsigned int arg)
{
    return (0);
}

/*
 *  ======== PowerCC26XX_getXoscStartupTime ========
 *  Get the estimated crystal oscillator startup time
 */
uint32_t PowerCC26XX_getXoscStartupTime(uint32_t timeUntilWakeupInMs)
{
    return (OSCHF_GetStartupTime(timeUntilWakeupInMs));
}

/*
 *  ======== PowerCC26XX_injectCalibration ========
 *  Explicitly trigger RCOSC calibration
 */
bool PowerCC26XX_injectCalibration(void)
{
    if ((*(PowerCC26XX_config.calibrateFxn))(PowerCC26XX_INITIATE_CALIBRATE)) {
        /* here if AUX SMPH was available, start calibration now ... */
        (*(PowerCC26XX_config.calibrateFxn))(PowerCC26XX_DO_CALIBRATE);
        return (TRUE);
    }

    return (FALSE);
}

/*
 *  ======== PowerCC26XX_isStableXOSC_HF ========
 *  Check if XOSC_HF has stabilized.
 */
bool PowerCC26XX_isStableXOSC_HF(void)
{
    bool ready = TRUE;
    unsigned int key;

    key = Hwi_disable();

    /* only query if HF source is ready if there is a pending change */
    if (PowerCC26XX_module.xoscPending) {
        ready = OSCHfSourceReady();
    }

    Hwi_restore(key);

    return (ready);
}

/*
 *  ======== PowerCC26XX_switchXOSC_HF ========
 *  Switch to enable XOSC_HF.
 */
void PowerCC26XX_switchXOSC_HF(void)
{
    unsigned int key;

    key = Hwi_disable();

    /* only switch source if there is a pending change */
    if (PowerCC26XX_module.xoscPending == TRUE) {
        OSCHF_AttemptToSwitchToXosc();
        PowerCC26XX_module.xoscPending = FALSE;
    }

    Hwi_restore(key);
}

/* * * * * * * * * * * internal and support functions * * * * * * * * * * */

/*
 *  ======== emptyClockFunc ========
 *  Clock function used by power policy to schedule early wakeups.
 */
static void emptyClockFunc(uintptr_t arg)
{
}

/*
 *  ======== disableLFClockQualifiers ========
 *  Clock function used for delayed disable of LF clock qualifiers.
 */
static void disableLFClockQualifiers(uintptr_t arg)
{
    uint32_t ccfgLfClkSrc;
    uint32_t sourceLF;
    uint32_t timeout;

     /* query LF clock source */
    sourceLF = OSCClockSourceGet(OSC_SRC_CLK_LF);

    /* is LF source either RCOSC_LF or XOSC_LF yet? */
    if ((sourceLF == OSC_RCOSC_LF) || (sourceLF == OSC_XOSC_LF)) {

        /* yes, disable the LF clock qualifiers */
        DDI16BitfieldWrite(
            AUX_DDI0_OSC_BASE,
            DDI_0_OSC_O_CTL0,
            DDI_0_OSC_CTL0_BYPASS_XOSC_LF_CLK_QUAL_M|
                DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_M,
            DDI_0_OSC_CTL0_BYPASS_RCOSC_LF_CLK_QUAL_S,
            0x3
        );

        /* enable clock loss detection */
        OSCClockLossEventEnable();

        /* now finish by releasing the standby disallow constraint */
        Power_releaseConstraint(PowerCC26XX_SB_DISALLOW);
    }

    /* not yet, LF still derived from HF, restart clock to check back later */
    else {
        /* read the LF clock source from CCFG */
        ccfgLfClkSrc = CCFGRead_SCLK_LF_OPTION();

        /* determine retry timeout */
        if (ccfgLfClkSrc == CCFGREAD_SCLK_LF_OPTION_RCOSC_LF) {
            timeout = PowerCC26XX_RETRYWAITRCOSC_LF;
        }
        else {
            timeout = PowerCC26XX_RETRYWAITXOSC_LF;
        }
        /* retrigger LF Clock to fire again */
        Clock_setTimeout(Clock_handle(&PowerCC26XX_module.lfClockObj),
            (timeout / Clock_tickPeriod));
        Clock_start(Clock_handle(&PowerCC26XX_module.lfClockObj));
    }
}

/*
 *  ======== nopResourceFunc ========
 *  special resource handler
 */
static unsigned int nopResourceHandler(unsigned int action)
{
    return (0);
}

/*
 *  ======== notify ========
 *  Send notifications to registered clients.
 *  Note: Task scheduling is disabled when this function is called.
 */
static unsigned int notify(uint32_t eventType)
{
    unsigned int status = Power_NOTIFYDONE;
    List_Elem *elem;
    Power_NotifyFxn notifyFxn;
    uintptr_t clientArg;

    /* if queue is empty, return immediately */
    if (!List_empty(&PowerCC26XX_module.notifyList)) {
        /* point to first client notify object */
        elem = List_head(&PowerCC26XX_module.notifyList);

        /* walk the queue and notify each registered client of the event */
        do {
            if (((Power_NotifyObj *)elem)->eventTypes & eventType) {
                /* pull params from notify object */
                notifyFxn = ((Power_NotifyObj *)elem)->notifyFxn;
                clientArg = ((Power_NotifyObj *)elem)->clientArg;

                /* call the client's notification function */
                status = (unsigned int)(*(Power_NotifyFxn)notifyFxn)(
                    eventType, 0, clientArg);

                /* if client declared error stop all further notifications */
                if (status == Power_NOTIFYERROR) {
                    return (Power_EFAIL);
                }
            }

            /* get next element in the notification queue */
            elem = List_next(elem);

        } while (elem != NULL);
    }

    return (status);
}

/*
 *  ======== configureRFCoreClocks ========
 *  Special dependency function for controlling RF core clocks.
 */
static unsigned int configureRFCoreClocks(unsigned int action)
{
    if (action == PowerCC26XX_ENABLE) {
        RFCClockEnable();
    }
    else {
        RFCClockDisable();
    }

    return (0);
}

