DanPhelanIDSY/tirtos_cc13xx_cc26xx_2_21_01_08/products/tidrivers_cc13xx_cc26xx_2_21_01_01/packages/ti/drivers/power/PowerCC26XX.c
/*
 *  ======== switchXOSCHFclockFunc ========
 *  Clock function used for delayed switching to XOSC_HF.
 */
static void switchXOSCHFclockFunc(uintptr_t arg0)
{
    bool readyToCal;
    uint32_t timeout;
    unsigned int key;

    key = Hwi_disable();

    /* if pending switch has already been made, just send out notifications */
    if (PowerCC26XX_module.xoscPending == FALSE) {

        /* initiate RCOSC calibration */
        readyToCal = (*(PowerCC26XX_config.calibrateFxn))(PowerCC26XX_INITIATE_CALIBRATE);

        /* notify clients that were waiting for a switch notification */
        notify(PowerCC26XX_XOSC_HF_SWITCHED);

        /* if ready to start first cal measurment, do it now */
        if (readyToCal == TRUE) {
            (*(PowerCC26XX_config.calibrateFxn))(PowerCC26XX_DO_CALIBRATE);
        }
    }

    /* else, if HF ready to switch, do it now ... */
    else if (OSCHF_AttemptToSwitchToXosc()) {

        PowerCC26XX_module.xoscPending = FALSE;

        /* initiate RCOSC calibration */
        readyToCal = (*(PowerCC26XX_config.calibrateFxn))(PowerCC26XX_INITIATE_CALIBRATE);

        /* now notify clients that were waiting for a switch notification */
        notify(PowerCC26XX_XOSC_HF_SWITCHED);

        /* if ready to start first cal measurment, do it now */
        if (readyToCal == TRUE) {
            (*(PowerCC26XX_config.calibrateFxn))(PowerCC26XX_DO_CALIBRATE);
        }
    }

    /* else, wait some more, then see if can switch ... */
    else {
        /* calculate wait timeout in units of ticks */
        timeout = PowerCC26XX_RETRYWAITXOSC_HF / Clock_tickPeriod;
        if (timeout == 0) {
            timeout = 1;   /* wait at least 1 tick */
        }

        /* re-start Clock object with retry timeout */
        Clock_setTimeout(
            Clock_handle(&PowerCC26XX_module.xoscClockObj), timeout);
        Clock_start(Clock_handle(&PowerCC26XX_module.xoscClockObj));
    }

    Hwi_restore(key);
}

/*
 *  ======== configureXOSCHF ========
 */
static unsigned int configureXOSCHF(unsigned int action)
{
    uint32_t timeout;

    if (action == PowerCC26XX_ENABLE) {
        if (OSCClockSourceGet(OSC_SRC_CLK_HF) != OSC_XOSC_HF) {
            OSCHF_TurnOnXosc();

            PowerCC26XX_module.xoscPending = TRUE;

            /* calculate wait timeout in units of ticks */
            timeout = PowerCC26XX_INITIALWAITXOSC_HF / Clock_tickPeriod;
            if (timeout == 0) {
                timeout = 1;   /* wait at least 1 tick */
            }

            /* start Clock object with initial timeout */
            Clock_stop(Clock_handle(&PowerCC26XX_module.xoscClockObj));
            Clock_setTimeout(Clock_handle(&PowerCC26XX_module.xoscClockObj),
                timeout);
            Clock_start(Clock_handle(&PowerCC26XX_module.xoscClockObj));
        }
    }

    /* when release XOSC_HF, auto switch to RCOSC_HF */
    else {
        OSCHF_SwitchToRcOscTurnOffXosc();
    }
    return (0);
}
